damon-yun/Kinetis_Bootloader/targets/LPC54114/src/pinmux_utility_lpc54511x.c
    switch (instance)
    {
#if BL_ENABLE_PINMUX_UART0
        case 0:
            
            // Only look for a falling edge for our interrupts
            /* Setup Pin Interrupt 1 for falling edge */
            PINT_PinInterruptConfig(PINT, UART0_RX_GPIO_PIN_INT_NUM, kPINT_PinIntEnableFallEdge, usart0_rx_gpio_pint_intr_callback);

            s_pin_irq_func[0] = func; 
            break;
#endif // #if BL_ENABLE_PINMUX_UART0

// #if BL_ENABLE_PINMUX_UART1
//         case 1:
//             NVIC_SetPriority(UART1_RX_GPIO_IRQn, PORT_IRQC_INTERRUPT_ENABLED_PRIORITY);
//             NVIC_EnableIRQ(UART1_RX_GPIO_IRQn);
//             // Only look for a falling edge for our interrupts
//             PORT_SetPinInterruptConfig(UART1_RX_PORT_BASE, UART1_RX_GPIO_PIN_NUM, kPORT_InterruptFallingEdge);
//             s_pin_irq_func[1] = func;
//             break;
// #endif // #if BL_ENABLE_PINMUX_UART1

// #if BL_ENABLE_PINMUX_UART2
//         case 2:
//             NVIC_SetPriority(UART2_RX_GPIO_IRQn, PORT_IRQC_INTERRUPT_ENABLED_PRIORITY);
//             NVIC_EnableIRQ(UART2_RX_GPIO_IRQn);
//             // Only look for a falling edge for our interrupts
//             PORT_SetPinInterruptConfig(UART2_RX_PORT_BASE, UART2_RX_GPIO_PIN_NUM, kPORT_InterruptFallingEdge);
//             s_pin_irq_func[2] = func;
//             break;
// #endif // #if BL_ENABLE_PINMUX_UART2

// #if BL_ENABLE_PINMUX_UART3
//         case 3:
//             NVIC_SetPriority(UART3_RX_GPIO_IRQn, PORT_IRQC_INTERRUPT_ENABLED_PRIORITY);
//             NVIC_EnableIRQ(UART3_RX_GPIO_IRQn);
//             // Only look for a falling edge for our interrupts
//             PORT_SetPinInterruptConfig(UART3_RX_PORT_BASE, UART3_RX_GPIO_PIN_NUM, kPORT_InterruptFallingEdge);
//             s_pin_irq_func[3] = func;
//             break;
// #endif // #if BL_ENABLE_PINMUX_UART3

// #if BL_ENABLE_PINMUX_UART4
//         case 4:
//             NVIC_SetPriority(UART4_RX_GPIO_IRQn, PORT_IRQC_INTERRUPT_ENABLED_PRIORITY);
//             NVIC_EnableIRQ(UART4_RX_GPIO_IRQn);
//             // Only look for a falling edge for our interrupts
//             PORT_SetPinInterruptConfig(UART4_RX_PORT_BASE, UART4_RX_GPIO_PIN_NUM, kPORT_InterruptFallingEdge);
//             s_pin_irq_func[4] = func;
//             break;
// #endif // #if BL_ENABLE_PINMUX_UART4

        default:
            break;
    }
    /* Enable callbacks for PINT */
    PINT_EnableCallback(PINT);
}

void disable_autobaud_pin_irq(uint32_t instance)
{
    switch (instance)
    {
#if BL_ENABLE_PINMUX_UART0
        case 0:
            s_pin_irq_func[0] = 0;
            break;
#endif // #if BL_ENABLE_PINMUX_UART0

// #if BL_ENABLE_PINMUX_UART1
//         case 1:
//             NVIC_DisableIRQ(UART1_RX_GPIO_IRQn);
//             NVIC_SetPriority(UART1_RX_GPIO_IRQn, PORT_IRQC_INTERRUPT_RESTORED_PRIORITY);
//             PORT_SetPinInterruptConfig(UART1_RX_PORT_BASE, UART1_RX_GPIO_PIN_NUM, kPORT_InterruptOrDMADisabled);
//             s_pin_irq_func[1] = 0;
//             break;
// #endif // #if BL_ENABLE_PINMUX_UART1

// #if BL_ENABLE_PINMUX_UART2
//         case 2:
//             NVIC_DisableIRQ(UART2_RX_GPIO_IRQn);
//             NVIC_SetPriority(UART2_RX_GPIO_IRQn, PORT_IRQC_INTERRUPT_RESTORED_PRIORITY);
//             PORT_SetPinInterruptConfig(UART2_RX_PORT_BASE, UART2_RX_GPIO_PIN_NUM, kPORT_InterruptOrDMADisabled);
//             s_pin_irq_func[2] = 0;
//             break;
// #endif // #if BL_ENABLE_PINMUX_UART2

// #if BL_ENABLE_PINMUX_UART3
//         case 3:
//             NVIC_DisableIRQ(UART3_RX_GPIO_IRQn);
//             NVIC_SetPriority(UART3_RX_GPIO_IRQn, PORT_IRQC_INTERRUPT_RESTORED_PRIORITY);
//             PORT_SetPinInterruptConfig(UART3_RX_PORT_BASE, UART3_RX_GPIO_PIN_NUM, kPORT_InterruptOrDMADisabled);
//             s_pin_irq_func[3] = 0;
//             break;
// #endif // #if BL_ENABLE_PINMUX_UART3

// #if BL_ENABLE_PINMUX_UART4
//         case 4:
//             NVIC_DisableIRQ(UART4_RX_GPIO_IRQn);
//             NVIC_SetPriority(UART4_RX_GPIO_IRQn, PORT_IRQC_INTERRUPT_RESTORED_PRIORITY);
//             PORT_SetPinInterruptConfig(UART4_RX_PORT_BASE, UART4_RX_GPIO_PIN_NUM, kPORT_InterruptOrDMADisabled);
//             s_pin_irq_func[4] = 0;
//             break;
// #endif // #if BL_ENABLE_PINMUX_UART4

        default:
            break;
    }

    PINT_Deinit(PINT);
}

////////////////////////////////////////////////////////////////////////////////
// EOF
////////////////////////////////////////////////////////////////////////////////
